spec/support/mvi/find_candidate_failure_response.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--
  This is a legacy response.
  It is not representative of an actual response that would contain an 'AR' typeCode.
  This response (INVALID REQUEST) today (Sept 12, 2019) would contain an 'AE' typeCode.
  This will be used to test processing 'AR' responses until we can generate a more realistic response.
-->
<env:Envelope xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
              xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <env:Header/>
  <env:Body>
    <idm:PRPA_IN201306UV02 xmlns="urn:hl7-org:v3" xmlns:idm="http://vaww.oed.oit.va.gov" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                           ITSVersion="XML_1.0" xsi:schemaLocation="urn:hl7-org:v3 ../../schema/HL7V3/NE2008/multicacheschemas/PRPA_IN201306UV02.xsd">
      <id extension="WSDOC1609141139020170904111811" root="2.16.840.1.113883.4.349"/>
      <creationTime value="20160914113902"/>
      <versionCode code="3.0"/>
      <interactionId extension="PRPA_IN201306UV02" root="2.16.840.1.113883.1.6"/>
      <processingCode code="T"/>
      <processingModeCode code="T"/>
      <acceptAckCode code="NE"/>
      <receiver typeCode="RCV">
        <device determinerCode="INSTANCE" classCode="DEV">
          <id extension="200VGOV" root="2.16.840.1.113883.4.349"/>
        </device>
      </receiver>
      <sender typeCode="SND">
        <device determinerCode="INSTANCE" classCode="DEV">
          <id extension="200M" root="2.16.840.1.113883.4.349"/>
        </device>
      </sender>
      <acknowledgement>
        <typeCode code="AR"/>
        <targetMessage>
          <id extension="MCID-12345" root="1.2.840.114350.1.13.0.1.7.1.1"/>
        </targetMessage>
        <acknowledgementDetail>
          <code codeSystem="2.16.840.1.113883.5.1100" code="INTERR" displayName="Internal System Error"/>
          <text>MVI[S]:INVALID REQUEST</text>
        </acknowledgementDetail>
        <acknowledgementDetail>
          <text>MVI[S]:INVALID REQUEST</text>
        </acknowledgementDetail>
      </acknowledgement>
      <controlActProcess classCode="CACT" moodCode="EVN">
        <code codeSystem="2.16.840.1.113883.1.6" code="PRPA_TE201306UV02"/>
        <queryAck>
          <queryId extension="18204" root="2.16.840.1.113883.3.933"/>
          <queryResponseCode code="AE"/>
          <resultCurrentQuantity value="0"/>
        </queryAck>
        <queryByParameter>
          <queryId extension="18204" root="2.16.840.1.113883.3.933"/>
          <statusCode code="new"/>
          <modifyCode code="MVI.COMP1"/>
          <initialQuantity value="1"/>
          <parameterList>
            <livingSubjectName>
              <value use="L">
                <given>John</given>
                <family>Smith</family>
              </value>
              <semanticsText>LivingSubject.name</semanticsText>
            </livingSubjectName>
            <livingSubjectBirthTime>
              <value value="19800101"/>
              <semanticsText>LivingSubject..birthTime</semanticsText>
            </livingSubjectBirthTime>
            <asOtherIDs classCode="SSN">
              <id extension="555443333" root="2.16.840.1.113883.4.1"/>
              <scopingOrganization determinerCode="INSTANCE" classCode="ORG">
                <id root="1.2.840.114350.1.13.99997.2.3412"/>
              </scopingOrganization>
            </asOtherIDs>
          </parameterList>
        </queryByParameter>
      </controlActProcess>
    </idm:PRPA_IN201306UV02>
  </env:Body>
</env:Envelope>
